FutureDesigns/uEZ/uEZ/Source/Devices/Flash/NXP/LPC17xx_40xx/LPC17xx_40xx_IAP.c
/*-------------------------------------------------------------------------*
 * Function:  CPUEnableInterrupts
 *-------------------------------------------------------------------------*
 * Description:
 *      Enables all standard CPU interrupts (IRQ).
 *-------------------------------------------------------------------------*/
static TIAPResult IIAPCmd(TUInt8 aCmd)
{
    // Pass on the command
    G_parameters[0] = aCmd;

    // Zap results so we know if nothing happened
    G_results[0] = NOTHING_HAPPENED;

    // Execute with interrupts turned off
    CPUDisableInterrupts();

    // Before doing any IAP commands, turn off the PLL
#if CONFIG_DISABLE_PLL_ON_IAP_COMMANDS
    CPUPLLStop();
#endif

    IAPCall(G_parameters, G_results);

    // Regardless of the result, turn back on the PLL
#if CONFIG_DISABLE_PLL_ON_IAP_COMMANDS
    CPUPLLStart();
#endif

    CPUEnableInterrupts();

    return G_results[0];
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPAddressToSectorNumber
 *---------------------------------------------------------------------------*
 * Description:
 *      Convert the address into a sector number.
 * Outputs:
 *      TUInt32                   -- Sector number, or -1 if invalid.
 *---------------------------------------------------------------------------*/
static TInt32 IIAPAddressToSectorNumber(TUInt32 aAddress)
{
    const T_sector *p_sector = G_sectorMemory;
    const T_sector *p_prev = 0;

    while (1) {
        if (aAddress < p_sector->iAddress)
            return p_prev->iIndex;
        p_prev = p_sector;
        p_sector++;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPEraseIfNotErased
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the given sector if not already erased.
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPEraseIfNotErased(TUInt32 aSector)
{
    T_uezError error;
    if (G_sectorsNeedingErase[aSector])
        error = IIAPCmdErase(aSector);
    else
        error = UEZ_ERROR_NONE;
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPCopyBytes
 *---------------------------------------------------------------------------*
 * Description:
 *      Copy in a section of bytes into the block offset by a prefix.
 * Inputs:
 *      TUInt8 *aData -- Pointer to data to read
 *      TUInt32 aPrefix -- Offset into the block to read
 *      TUInt32 aNumBytes -- Number of bytes to read.
 *---------------------------------------------------------------------------*/
static void IIAPCopyBytes(TUInt8 *aData, TUInt32 aPrefix, TUInt32 aNumBytes)
{
    TUInt32 i;

    // Copy over the section of bytes we are going to
    // write
    for (i = 0; i < aNumBytes; i++, aData++)
        G_block[aPrefix++] = *aData;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPCmdErase
 *---------------------------------------------------------------------------*
 * Description:
 *      Erase the given sector.
 * Inputs:
 *      TUInt32 aSector -- Sector to erase
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPCmdErase(TUInt32 aSector)
{
    T_uezError error;

    // Prepare the sector for erase
    error = IIAPPrepareSector(aSector);
    if (error)
        return error;

    // Start sector
    G_parameters[1] = aSector;
    // End sector
    G_parameters[2] = aSector;
    // Clock frequency in kHz
    G_parameters[3] = PRG_FREQUENCY / 1000;

    if (IIAPCmd(IAP_CMD_ERASE_SECTOR) != CMD_SUCCESS)
        return UEZ_ERROR_COULD_NOT_ERASE;

    // Mark sector as erased
    G_sectorsNeedingErase[aSector] = EFalse;

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPPrepareSector
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare a sector for modification.
 * Inputs:
 *      TUInt32 aSector -- Sector to prepare
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPPrepareSector(TUInt32 aSector)
{
    // Start and end sector are the same
    G_parameters[1] = G_parameters[2] = aSector;

    if (IIAPCmd(IAP_CMD_PREPARE_SECTOR) != CMD_SUCCESS)
        return UEZ_ERROR_INCOMPLETE;

    // Got here?  Then it was good
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPFlashBlock
 *---------------------------------------------------------------------------*
 * Description:
 *      Flash a block of data with the current block.
 * Inputs:
 *      TUInt32 aAddress -- Address to write block
 *      TUInt32 aNumBytes -- Number of bytes to write
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPFlashBlock(TUInt32 aAddress, TUInt32 aNumBytes)
{
    // First, we have to prep the location
    IIAPPrepareSector(IIAPAddressToSectorNumber(aAddress));

    // Now we can write the complete block
    G_parameters[1] = aAddress;
    G_parameters[2] = (TUInt32)G_block;
    G_parameters[3] = aNumBytes;
    G_parameters[4] = PRG_FREQUENCY / 1000;

    if (IIAPCmd(IAP_CMD_COPY_TO_FLASH) != CMD_SUCCESS)
        return UEZ_ERROR_READ_WRITE_ERROR;

    // Got here, must have been good
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IIAPSelectBlock
 *---------------------------------------------------------------------------*
 * Description:
 *      Select which block we are going to modify next
 * Inputs:
 *      TUInt32 aBlockAddress -- Address to select
 * Outputs:
 *      T_uezError -- UEZ_ERROR_NONE if successful, else error code.
 *---------------------------------------------------------------------------*/
static T_uezError IIAPSelectBlock(TUInt32 aBlockAddress)
{
    TUInt32 i;
    TInt32 sector;
    T_uezError error = UEZ_ERROR_NONE;

